<template>
  <b-container class="my-5">
    <b-row>
      <b-breadcrumb>
        <b-breadcrumb-item href="#bank" active>
          Оплата
        </b-breadcrumb-item>
      </b-breadcrumb>
    </b-row>
    <b-row class="mb-4">
        <b-col>
            <p class="title-font">Оплата</p>
        </b-col>
    </b-row>
    <b-row class="mb-5">
        <b-col>
            <p class="text-small">
                Оплата банковскими картами осуществляется через ЗАО «Альфа-Банк».
                <br> <br>

                К оплате принимаются карты международных платежных систем VISA, MasterCard. 
            </p>

            <p class="text-small">
              Компания принимает Заказы через интернет-сайт круглосуточно и ежедневно. 
              Заказы обрабатываются менеджером на следующий рабочий день после поступления заказа. 
              Покупатель может получить информацию по интересующей его услуге по телефонам, указанным на сайте, в рабочее время. 
              После совершения оплаты с использованием банковской карточки рекомендуем сохранять полученные карт-чеки и подтверждения 
              об оплате для сверки с выпиской из карт-счёта 
              (с целью подтверждения совершённых операций в случае возникновения спорных ситуаций).
            </p>
            <b-link class="clr-blue" @click="showFullInfoFlag = true;">
                Ознакомиться подробнее
            </b-link>
       
            <p class="text-small" v-if='showFullInfoFlag'>
                <br>
              
              При оплате банковской платежной карточкой возврат наличными денежными средствами не допускается. 
              Расчеты с потребителем при возврате уплаченной за услугу денежной суммы, при расторжении договора 
              об оказании услуги осуществляются в той же форме, в которой производилась оплата услуги. 
              Порядок возврата регулируется правилами платежных систем. Для возврата денежных средств на банковскую 
              платежную карточку необходимо заполнить «Заявление о возврате денежных средств» и отправить его по электронному 
              адресу invisible.world.center@gmail.com . Возврат денежных средств будет осуществлен на банковскую платежную карточку 
              в течение 7 (семи) календарных дней со дня получения «Заявление о возврате денежных средств» Компанией. 
              Сумма возврата будет равняться сумме покупки Для возврата денежных средств по операциям проведенными с 
              ошибками необходимо обратиться с письменным заявлением и приложением чеков/квитанций, подтверждающих ошибочное списание. 
              Данное заявление необходимо направить по электронному адресу invisible.world.center@gmail.com 
                <br>
                <br>
                Безопасность совершения платежа обеспечивается современными методами проверки, шифрования 
                и передачи данных по закрытым каналам связи. 

                Ввод данных карточки осуществляется на защищенной авторизационной странице банка. Для 
                оплаты необходимо ввести реквизиты карточки: номер, имя держателя, срок действия и 
                трехзначный код безопасности. Трёхзначный код безопасности (CVV2 для VISA, CVC2 для 
                MasterCard) — это три цифры, находящиеся на обратной стороне карточки. Если карточка 
                поддерживает технологию 3DSecure или Интернет-пароль для держателей карточек БЕЛКАРТ, Вы 
                будете перенаправлены на страницу банка, выпустившего карточку, для ввода кода безопасности. 
                При оплате с помощью Apple Pay выберете карту из приложения Wallet, воспользуйтесь код-
                паролем или иным способом аутентификации, в зависимости от того, какой способ выбран в 
                приложении. При оформлении заказа с помощью Samsung Pay нажмите «Оплатить Samsung Pay», 
                введите ваш Samsung Account и подтвердите покупку на вашем смартфоне (по отпечатку пальца, 
                радужке или PIN-коду Samsung Pay).
                <br> <br>
                Предоставляемая Вами персональная информация (например: имя, адрес, телефон, e-mail, номер
                банковской карты и прочее) является конфиденциальной и не подлежит разглашению. 
                Данные карточки передаются только в зашифрованном виде и не сохраняются на данном 
            </p>
        </b-col>
    </b-row>
  </b-container>
</template>

<script>
  export default {
    name: "Bank",
    data() {
      return {
          showFullInfoFlag: false,
      }
    },
    methods: {

    }
  }
</script>
